Show / Hide Table of Contents
Class SerializableDictionary<TKey, TVal>
SerializableDictionary
Inheritance
System.Object
System.Collections.Generic.Dictionary<TKey, TVal>
SerializableDictionary<TKey, TVal>
ConversionDictionary<TKey>
Implements
System.Collections.Generic.IDictionary<TKey, TVal>
System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>
System.Collections.IDictionary
System.Collections.ICollection
System.Collections.Generic.IReadOnlyDictionary<TKey, TVal>
System.Collections.Generic.IReadOnlyCollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>
System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<TKey, TVal>>
System.Collections.IEnumerable
System.Runtime.Serialization.IDeserializationCallback
System.Xml.Serialization.IXmlSerializable
System.Runtime.Serialization.ISerializable
Inherited Members
 System.Collections.Generic.Dictionary<TKey, TVal>.Add(TKey, TVal)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>.Add(System.Collections.Generic.KeyValuePair<TKey, TVal>)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>.Contains(System.Collections.Generic.KeyValuePair<TKey, TVal>)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>.Remove(System.Collections.Generic.KeyValuePair<TKey, TVal>)
 System.Collections.Generic.Dictionary<TKey, TVal>.Clear()
 System.Collections.Generic.Dictionary<TKey, TVal>.ContainsKey(TKey)
 System.Collections.Generic.Dictionary<TKey, TVal>.ContainsValue(TVal)
 System.Collections.Generic.Dictionary<TKey, TVal>.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<TKey, TVal>>.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, TVal>.GetObjectData(System.Runtime.Serialization.SerializationInfo, System.Runtime.Serialization.StreamingContext)
 System.Collections.Generic.Dictionary<TKey, TVal>.OnDeserialization(System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.Remove(TKey)
 System.Collections.Generic.Dictionary<TKey, TVal>.TryGetValue(TKey, TVal)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>.CopyTo(System.Collections.Generic.KeyValuePair<TKey, TVal>[], System.Int32)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.ICollection.CopyTo(System.Array, System.Int32)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IEnumerable.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.get_Item(System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.set_Item(System.Object, System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Add(System.Object, System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Contains(System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Remove(System.Object)
 System.Collections.Generic.Dictionary<TKey, TVal>.Comparer
 System.Collections.Generic.Dictionary<TKey, TVal>.Count
 System.Collections.Generic.Dictionary<TKey, TVal>.Keys
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.IDictionary<TKey, TVal>.Keys
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.IReadOnlyDictionary<TKey, TVal>.Keys
 System.Collections.Generic.Dictionary<TKey, TVal>.Values
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.IDictionary<TKey, TVal>.Values
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.IReadOnlyDictionary<TKey, TVal>.Values
 System.Collections.Generic.Dictionary<TKey, TVal>.Item[TKey]
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, TVal>>.IsReadOnly
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.ICollection.IsSynchronized
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.ICollection.SyncRoot
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.IsFixedSize
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.IsReadOnly
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Keys
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Values
 System.Collections.Generic.Dictionary<TKey, TVal>.System.Collections.IDictionary.Item[System.Object]
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[Serializable]
public class SerializableDictionary<TKey, TVal> : Dictionary<TKey, TVal>, IDictionary<TKey, TVal>, ICollection<KeyValuePair<TKey, TVal>>, IDictionary, ICollection, IReadOnlyDictionary<TKey, TVal>, IReadOnlyCollection<KeyValuePair<TKey, TVal>>, IEnumerable<KeyValuePair<TKey, TVal>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Type Parameters
 Name |  Description
 TKey
 TVal
Constructors
Improve this Doc   View Source
SerializableDictionary()
Declaration
public SerializableDictionary()
Improve this Doc   View Source
SerializableDictionary(IDictionary<TKey, TVal>)
Declaration
public SerializableDictionary(IDictionary<TKey, TVal> dictionary)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IDictionary<TKey, TVal> |  dictionary
Improve this Doc   View Source
SerializableDictionary(IDictionary<TKey, TVal>, IEqualityComparer<TKey>)
Declaration
public SerializableDictionary(IDictionary<TKey, TVal> dictionary, IEqualityComparer<TKey> comparer)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IDictionary<TKey, TVal> |  dictionary
 System.Collections.Generic.IEqualityComparer<TKey> |  comparer
Improve this Doc   View Source
SerializableDictionary(IEqualityComparer<TKey>)
Declaration
public SerializableDictionary(IEqualityComparer<TKey> comparer)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IEqualityComparer<TKey> |  comparer
Improve this Doc   View Source
SerializableDictionary(Int32)
Declaration
public SerializableDictionary(int capacity)
Parameters
 Type |  Name |  Description
 System.Int32 |  capacity
Improve this Doc   View Source
SerializableDictionary(Int32, IEqualityComparer<TKey>)
Declaration
public SerializableDictionary(int capacity, IEqualityComparer<TKey> comparer)
Parameters
 Type |  Name |  Description
 System.Int32 |  capacity
 System.Collections.Generic.IEqualityComparer<TKey> |  comparer
Improve this Doc   View Source
SerializableDictionary(SerializationInfo, StreamingContext)
Declaration
protected SerializableDictionary(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
 System.Runtime.Serialization.StreamingContext |  context
Properties
Improve this Doc   View Source
ValueSerializer
Declaration
protected XmlSerializer ValueSerializer { get; }
Property Value
 Type |  Description
 System.Xml.Serialization.XmlSerializer
Explicit Interface Implementations
Improve this Doc   View Source
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
Declaration
void ISerializable.GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
 System.Runtime.Serialization.StreamingContext |  context
Improve this Doc   View Source
IXmlSerializable.GetSchema()
Declaration
XmlSchema IXmlSerializable.GetSchema()
Returns
 Type |  Description
 System.Xml.Schema.XmlSchema
Improve this Doc   View Source
IXmlSerializable.ReadXml(XmlReader)
Declaration
void IXmlSerializable.ReadXml(XmlReader reader)
Parameters
 Type |  Name |  Description
 System.Xml.XmlReader |  reader
Improve this Doc   View Source
IXmlSerializable.WriteXml(XmlWriter)
Declaration
void IXmlSerializable.WriteXml(XmlWriter writer)
Parameters
 Type |  Name |  Description
 System.Xml.XmlWriter |  writer
Implements
 System.Collections.Generic.IDictionary<TKey, TValue>
 System.Collections.Generic.ICollection<T>
 System.Collections.IDictionary
 System.Collections.ICollection
 System.Collections.Generic.IReadOnlyDictionary<TKey, TValue>
 System.Collections.Generic.IReadOnlyCollection<T>
 System.Collections.Generic.IEnumerable<T>
 System.Collections.IEnumerable
 System.Runtime.Serialization.IDeserializationCallback
 System.Xml.Serialization.IXmlSerializable
 System.Runtime.Serialization.ISerializable
 Improve this Doc
 View Source